In [1]:
!pip install bs4
!pip install requests

Requirement already satisfied: bs4 in c:\users\pinki\anaconda3\lib\site-packages (0.0.1)
Requirement already satisfied: beautifulsoup4 in c:\users\pinki\anaconda3\lib\site-packages (from bs4) (4.9.3)
Requirement already satisfied: soupsieve>1.2 in c:\users\pinki\anaconda3\lib\site-packages (from beautifulsoup4->bs4) (2.2.1)
Requirement already satisfied: requests in c:\users\pinki\anaconda3\lib\site-packages (2.25.1)
Requirement already satisfied: chardet<5,>=3.0.2 in c:\users\pinki\anaconda3\lib\site-packages (from requests) (4.0.0)
Requirement already satisfied: idna<3,>=2.5 in c:\users\pinki\anaconda3\lib\site-packages (from requests) (2.10)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\pinki\anaconda3\lib\site-packages (from requests) (1.26.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\pinki\anaconda3\lib\site-packages (from requests) (2020.12.5)

In [2]:
# importing the required libraries
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [3]:
page=requests.get('https://en.wikipedia.org/wiki/Main_Page')
page

In [4]:
soup=BeautifulSoup(page.content,'html.parser')
heading=soup.find_all(['h1','h2','h3'])
for i in heading:
    print(i.text)

Main Page
Welcome to Wikipedia
From today's featured article
Did you know ...
In the news
On this day
Today's featured picture
Other areas of Wikipedia
Wikipedia's sister projects
Wikipedia languages
Navigation menu

Personal tools


Namespaces


English
expanded
collapsed


Views


More
expanded
collapsed


Search


Navigation


Contribute


Tools


Print/export


In other projects


Languages

**Q2) Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. name, rating, year of release)
and make data frame.**

In [5]:
page=requests.get('https://www.imdb.com/list/ls091520106/')
page

In [6]:
soup=BeautifulSoup(page.content,"html.parser")

In [7]:
name=soup.find_all("h3",class_="lister-item-header")
rating=soup.find_all('div',class_="ipl-rating-star small")
date_of_release=soup.find_all("span",class_="lister-item-year text-muted unbold")

In [11]:
mname=[]
rt=[]
dor=[]
for i in name:
    mname.append(i.a.text)
for i in rating:
    rt.append(i.text.strip())
for i in date_of_release:
    dor.append(i.text)

In [12]:
top_100={"Movie":mname,"Rating":rt,"Date of release":dor}
df=pd.DataFrame(top_100)

In [13]:
df

                                  Movie Rating Date of release
0              The Shawshank Redemption    9.3          (1994)
1                         The Godfather    9.2          (1972)
2                The Godfather: Part II      9          (1974)
3                       The Dark Knight      9          (2008)
4                          12 Angry Men      9          (1957)
..                                  ...    ...             ...
95                   North by Northwest    8.3          (1959)
96                   A Clockwork Orange    8.3          (1971)
97                               Snatch    8.2          (2000)
98  Le fabuleux destin d'Amélie Poulain    8.3          (2001)
99                              The Kid    8.3          (1921)

[100 rows x 3 columns]

**Q3) Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. name, rating, year of
release) and make data frame.**

In [14]:
page=requests.get('https://www.imdb.com/india/top-rated-indian-movies/')
page

In [15]:
soup=BeautifulSoup(page.content,'html.parser')

In [16]:
name=soup.find_all("td",class_="titleColumn")
rating=soup.find_all("td",class_="ratingColumn imdbRating")
yor=soup.find_all("span",class_="secondaryInfo")

In [17]:
mn=[]
rt=[]
yr=[]
for i in name:
    mn.append(i.a.text)
for i in rating:
    rt.append(i.text.strip())
for i in yor:
    yr.append(i.text)

In [18]:
IMBD={"Name":mn[:100],"Rating":rt[:100],"Year of release":yr[:100]}
dt=pd.DataFrame(IMBD)

In [19]:
dt

                        Name Rating Year of release
0          Pariyerum Perumal    8.5          (2018)
1                    Nayakan    8.5          (1987)
2          C/o Kancharapalem    8.5          (2018)
3                 Anbe Sivam    8.5          (2003)
4                   Kireedam    8.5          (1989)
..                       ...    ...             ...
95                 Charulata    8.1          (1964)
96                 Sarfarosh    8.1          (1999)
97  Uri: The Surgical Strike    8.1          (2019)
98                      Roja    8.1          (1992)
99           Rang De Basanti    8.1          (2006)

[100 rows x 3 columns]

 **Q4)Write a python programe to scrape product name, price and discounts from  https://meesho.com/bagsladies/pl/p7vbp .**

In [20]:
page=requests.get('https://meesho.com/bagsladies/pl/p7vbp')
page

In [21]:
soup=BeautifulSoup(page.content,'html.parser')

In [22]:
prname=soup.find_all("div",class_="Card__BaseCard-sc-b3n78k-0 dUNFgg NewProductCard__DetailCard_Desktop-sc-j0e7tu-2 fqvaeS NewProductCard__DetailCard_Desktop-sc-j0e7tu-2 fqvaeS")
pr=soup.find_all("h5",class_="Text__StyledText-sc-oo0kvp-0 hiHdyy")
dis=soup.find_all("p",class_="Text__StyledText-sc-oo0kvp-0 fCJVtz NewProductCard__DiscountTextParagraph-sc-j0e7tu-16 kmYsnm NewProductCard__DiscountTextParagraph-sc-j0e7tu-16 kmYsnm")

In [26]:
pname=[]
amt=[]
ds=[]
for i in prname:
    pname.append(i.p.text)
for i in pr:
    amt.append(i.text)
for i in dis:
    ds.append(i.text)

In [27]:
bag={"Product":pname,"Price":amt,"Discount":ds}
dt=pd.DataFrame(bag)

In [28]:
dt

,Product,Price,Discount
0,Ravishing Fancy Women Handbags,₹255,₹100 discount on 1st order
1,Graceful Classy Women Handbags,₹328,₹100 discount on 1st order
2,Elite Classy Women Handbags,₹332,₹100 discount on 1st order
3,Graceful Versatile Women Handbags,₹574,₹100 discount on 1st order
4,Voguish Attractive Women Handbags,₹458,₹100 discount on 1st order
5,Elegant Versatile Women Handbags,₹1045,₹100 discount on 1st order
6,Elegant Versatile Women Handbags,₹177,₹75 discount on 1st order
7,Ravishing Attractive Women Handbags,₹384,₹100 discount on 1st order
8,Elegant Fashionable Women Handbags,₹199,₹84 discount on 1st order
9,Elite Versatile Women Handbags,₹313,₹100 discount on 1st order
10,Gorgeous Classy Women Handbags,₹349,₹100 discount on 1st order
11,Elite Stylish Women Handbags,₹550,₹100 discount on 1st order
12,Elegant Fancy Women's Bags,₹189,₹80 discount on 1st order
13,Trendy Classy Women Handbags,₹415,₹100 discount on 1st order
14,Elegant Fancy Women'S Pu Leather Hand Bags,₹175,₹75 discount on 1st order
15,Gorgeous Attractive Women Handbags,₹196,₹84 discount on 1st order
16,Elite Fancy Women Handbags,₹140,₹60 discount on 1st order
17,Ravishing Alluring Women Handbags,₹130,₹55 discount on 1st order
18,Elegant Classy Women Handbags,₹319,₹100 discount on 1st order
19,Classic Classy Women Handbags,₹231,₹99 discount on 1st order

**Q5) Write a python program to scrape cricket rankings from icc-cricket.com. You have to scrape:**

**a) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.**

**b) Top 10 ODI Batsmen along with the records of their team and rating.**

**c) Top 10 ODI bowlers along with the records of their team and rating.**

## a) **Top 10 ODI teams in men’s**

In [29]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')
page

In [30]:
soup=BeautifulSoup(page.content,'html.parser')

In [31]:
team=soup.find_all('span',class_="u-hide-phablet")
match=soup.find_all("td")

In [32]:
mt=[]
pt=[]
rt=[]
tm=[]
for i in range(len(match)):
    if i%5==2:
        mt.append(match[i].text)
    elif i%5==3:
        pt.append(match[i].text)
    elif i%5==4:
        rt.append(match[i].text.strip())
for i in team:
    tm.append(i.text.strip())

In [33]:
ODI={"Team":tm[:10],"Match":mt[:10],"Point":pt[:10],"Rating":rt[:10]}
df=pd.DataFrame(ODI)

In [34]:
df

           Team Match  Point Rating
0   New Zealand    17  2,054    121
1       England    32  3,793    119
2     Australia    28  3,244    116
3         India    38  4,162    110
4  South Africa    28  2,943    105
5      Pakistan    27  2,524     93
6    Bangladesh    32  2,973     93
7     Sri Lanka    35  2,835     81
8   West Indies    36  2,788     77
9   Afghanistan    22  1,419     65

## b)**Top 10 ODI Batsmen**

In [35]:
page=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting")
page

In [36]:
soup=BeautifulSoup(page.content,"html.parser")

In [37]:
btman=soup.find_all("td")

In [38]:
nm=[]
tm=[]
rt=[]
for i in range(len(btman)):
    if i%5==1:
        nm.append(btman[i].text.strip())
    elif i%5==2:
        tm.append(btman[i].text.strip())
    elif i%5==3:
        rt.append(btman[i].text.strip())

In [39]:
ODTBT={"Batsman":nm[:10],"Team":tm[:10],"Rating":rt[:10]}
dr=pd.DataFrame(ODTBT)

In [40]:
dr

                 Batsman Team Rating
0             Babar Azam  PAK    873
1            Virat Kohli  IND    811
2           Rohit Sharma  IND    791
3        Quinton de Kock   SA    783
4            Aaron Finch  AUS    779
5         Jonny Bairstow  ENG    775
6           David Warner  AUS    762
7  Rassie van der Dussen   SA    750
8           Fakhar Zaman  PAK    741
9               Joe Root  ENG    740

# c) **Top 10 ODI bowlers**

In [41]:
page=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling")
page

In [42]:
soup=BeautifulSoup(page.content,"html.parser")

In [43]:
bwl=soup.find_all("td")

In [44]:
nm=[]
tm=[]
rt=[]
for i in range(len(bwl)):
    if i%5==1:
        nm.append(bwl[i].text.strip())
    elif i%5==2:
        tm.append(bwl[i].text.strip())
    elif i%5==3:
        rt.append(bwl[i].text.strip())

In [45]:
ODTBWL={"Bowler":nm[:10],"Team":tm[:10],"Rating":rt[:10]}
dr=pd.DataFrame(ODTBWL)

In [46]:
dr

             Bowler Team Rating
0       Trent Boult   NZ    737
1    Josh Hazlewood  AUS    709
2      Chris Woakes  ENG    700
3  Mujeeb Ur Rahman  AFG    697
4      Mehedi Hasan  BAN    692
5        Matt Henry   NZ    691
6    Jasprit Bumrah  IND    679
7    Mitchell Starc  AUS    652
8   Shakib Al Hasan  BAN    650
9      Andy McBrine  IRE    646

**Q6)Write a python program to scrape cricket rankings from icc-cricket.com. You have to scrape:**
    
**a) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating**

**b) Top 10 women’s ODI Batting players along with the records of their team and rating**

**c) Top 10 women’s ODI all-rounder along with the records of their team and rating**

## a) Top 10 ODI teams in women’s

In [47]:
page=requests.get("https://www.icc-cricket.com/rankings/womens/team-rankings/odi")
page

In [48]:
soup=BeautifulSoup(page.content,"html.parser")

In [49]:
women=soup.find_all("td")
team=soup.find_all("span",class_="u-hide-phablet")

In [50]:
nm=[]
mt=[]
pt=[]
rt=[]
for i in range(len(women)):
    if i%5==2:
        mt.append(women[i].text.strip())
    elif i%5==3:
        pt.append(women[i].text.strip())
    elif i%5==4:
            rt.append(women[i].text.strip())
for i in team:
    nm.append(i.text.strip())

In [51]:
ODIWM={"Team":nm[:10],"Matches":mt[:10],"Points":pt[:10],"Rating":rt[:10]}
dr1=pd.DataFrame(ODIWM)

In [52]:
dr1

           Team Matches Points Rating
0     Australia      20  3,263    163
1  South Africa      21  2,580    123
2       England      21  2,474    118
3         India      22  2,221    101
4   New Zealand      24  2,342     98
5    Bangladesh       5    475     95
6   West Indies      21  1,801     86
7      Pakistan      19  1,304     69
8       Ireland       5    240     48
9     Sri Lanka       5    233     47

## b) Top 10 women’s ODI Batting players

In [53]:
page=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting")
page

In [54]:
soup=BeautifulSoup(page.content,"html.parser")

In [55]:
women=soup.find_all("td")

In [56]:
nm=[]
tm=[]
rt=[]
for i in range(len(women)):
    if i%5==1:
        nm.append(women[i].text.strip())
    elif i%5==2:
        tm.append(women[i].text.strip())
    elif i%5==3:
        rt.append(women[i].text.strip())

In [57]:
woteam={"Name":nm[:10],"Team":tm[:10],"Rating":rt[:10]}
drt=pd.DataFrame(woteam)

In [58]:
drt

                Name Team Rating
0       Alyssa Healy  AUS    749
1        Mithali Raj  IND    741
2  Amy Satterthwaite   NZ    719
3     Tammy Beaumont  ENG    707
4        Meg Lanning  AUS    706
5        Beth Mooney  AUS    705
6        Lizelle Lee   SA    702
7    Smriti Mandhana  IND    668
8    Laura Wolvaardt   SA    661
9       Ellyse Perry  AUS    661

## **c)Top 10 women’s ODI all-rounder**

In [59]:
page=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder")
page

In [60]:
soup=BeautifulSoup(page.content,"html.parser")

In [61]:
women=soup.find_all("td")

In [62]:
nm=[]
tm=[]
rt=[]
for i in range(len(women)):
    if i%5==1:
        nm.append(women[i].text.strip())
    elif i%5==2:
        tm.append(women[i].text.strip())
    elif i%5==3:
        rt.append(women[i].text.strip())

In [63]:
ODIWOM={"Name":nm[:10],"Team":tm[:10],"Rating":rt[:10]}
fr=pd.DataFrame(ODIWOM)

In [64]:
fr

               Name Team Rating
0      Ellyse Perry  AUS    438
1    Natalie Sciver  ENG    351
2    Marizanne Kapp   SA    327
3     Deepti Sharma  IND    316
4   Katherine Brunt  ENG    273
5       Amelia Kerr   NZ    269
6     Jess Jonassen  AUS    263
7   Stafanie Taylor   WI    262
8  Ashleigh Gardner  AUS    256
9   Hayley Matthews   WI    254

**Q7) Write a python program to scrape details of all the posts from coreyms.com. Scrape the heading, date, content
and the code for the video from the link for the youtube video from the post.**

In [65]:
page=requests.get("https://coreyms.com/")
page

In [66]:
soup=BeautifulSoup(page.content,"html.parser")

In [67]:
heading=soup.find_all("h2")
date=soup.find_all("time",class_="entry-time")
content=soup.find_all("div",class_="entry-content")
code=soup.find_all("iframe",class_="youtube-player")

In [71]:
hd=[]
dt=[]
con=[]
cd=[]
for i in heading:
    hd.append(i.text.strip())
for i in date:
    dt.append(i.text.strip())
for i in content:
    con.append(i.text.strip())
for i in code:
    cd.append(i["src"])

In [72]:
course={"Heading":hd[:9],"Date":dt[:9],"Content":con[:9],"Code":cd[:9]}

In [73]:
course1=pd.DataFrame(course)

In [74]:
course1

,Heading,Date,Content,Code
0,Python Tutorial: Zip Files – Creating and Extr...,"November 19, 2019","In this video, we will be learning how to crea...",https://www.youtube.com/embed/z0gguhEmWiY?vers...
1,Python Data Science Tutorial: Analyzing the 20...,"October 17, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/_P7X8tMplsw?vers...
2,Python Multiprocessing Tutorial: Run Code in P...,"September 21, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/fKl2JW_qrso?vers...
3,Python Threading Tutorial: Run Code Concurrent...,"September 12, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/IEEhzQoKtQU?vers...
4,Update (2019-09-03),"September 3, 2019",Hey everyone. I wanted to give you an update o...,https://www.youtube.com/embed/mO_dS3rXDIs?vers...
5,Python Quick Tip: The Difference Between “==” ...,"August 6, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/2Fp1N6dof0Y?vers...
6,Python Tutorial: Calling External Commands Usi...,"July 24, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/-nh9rCzPJ20?vers...
7,Visual Studio Code (Windows) – Setting up a Py...,"May 1, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/06I63_p-2A4?vers...
8,Visual Studio Code (Mac) – Setting up a Python...,"May 1, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/_JGmemuINww?vers...

##**Q8)Write a python program to scrape house details from mentioned URL. It should include house title, location,
area, EMI and price from https://www.nobroker.in/ .Enter three localities which are Indira Nagar, Jayanagar, 
Rajaji Nagar.**

In [75]:
page=requests.get("https://www.nobroker.in/property/sale/bangalore/multiple?searchParam=W3sibGF0IjoxMi45NzgzNjkyLCJsb24iOjc3LjY0MDgzNTYsInBsYWNlSWQiOiJDaElKa1FOM0dLUVdyanNSTmhCUUpyaEdEN1UiLCJwbGFjZU5hbWUiOiJJbmRpcmFuYWdhciJ9LHsibGF0IjoxMi45MzA3NzM1LCJsb24iOjc3LjU4MzgzMDIsInBsYWNlSWQiOiJDaElKMmRkbFo1Z1ZyanNSaDFCT0FhZi1vcnMiLCJwbGFjZU5hbWUiOiJKYXlhbmFnYXIifSx7ImxhdCI6MTIuOTk4MTczMiwibG9uIjo3Ny41NTMwNDQ1OTk5OTk5OSwicGxhY2VJZCI6IkNoSUp4Zlc0RFBNOXJqc1JLc05URy01cF9RUSIsInBsYWNlTmFtZSI6IlJhamFqaW5hZ2FyIn1d&radius=2.0&city=bangalore&locality=Indiranagar,&locality=Jayanagar,&locality=Rajajinagar")
page

In [76]:
soup=BeautifulSoup(page.content,"html.parser")

In [77]:
htitle=soup.find_all("h2",class_="heading-6 flex items-center font-semi-bold m-0")
loc=soup.find_all("div",class_="mt-0.5p overflow-hidden overflow-ellipsis whitespace-nowrap max-w-70 text-gray-light leading-4 po:mb-0 po:max-w-95")
ar=soup.find_all("div",id="minRent")   
em=soup.find_all("div",id="roomType")
pr=soup.find_all("div",class_="flex flex-col w-33pe items-center bo tp:w-half po:w-full border-r-0")

In [83]:
ht=[]
lc=[]
r=[]
emi=[]
amt=[]
for i in htitle:
    ht.append(i.text)
for i in loc:
    lc.append(i.text)
for i in ar:
    r.append(i.text)
for i in em:
    emi.append(i.text)
for i in pr:
    amt.append(i.text)

In [85]:
housetype={"Housetitle":ht,"Location":lc,"Area":r,"Emi":emi,"Price":amt}

In [86]:
dt1=pd.DataFrame(housetype)

In [87]:
dt1

,Housetitle,Location,Area,Emi,Price
0,"3 BHK Flat For Sale In Sobha Indraprastha, R...","Minerva Mills Compound,Opposite Sujata Theatre...","2,200 sqft",₹2.06 Lacs/Month,"₹3.6 Crores₹16,364 per sq.ft."
1,3 BHK Flat For Sale In Sgrr Pallavi Pristin...,"11th Main Road,36 Cross, 4th T Block, Near ,Po...","1,340 sqft","₹74,508/Month","₹1.3 Crores₹9,701 per sq.ft."
2,2 BHK In Independent House For Sale In 9th B...,"Independent House, 41 A Cross, 18th Main, Jaya...","1,500 sqft","₹65,911/Month","₹1.15 Crores₹7,667 per sq.ft."
3,3 BHK Flat For Sale In Total Environment Lif...,"30th Cross Rd, 4th T Block , Jayanagar, Bengal...","2,628 sqft",₹1.72 Lacs/Month,"₹3 Crores₹11,416 per sq.ft."
4,4 BHK In Independent House For Sale In Jayan...,"Independent House, 47th Cross Rd, 8th Block, 1...","3,700 sqft",₹5.44 Lacs/Month,"₹9.5 Crores₹25,676 per sq.ft."

**Q9) Write a python program to scrape mentioned details from dineout.co.in :**

**i) Restaurant name**

**ii) Cuisine**

**iii) Location**

**iv) Ratings**

**v) Image URL**

In [88]:
page=requests.get("https://www.dineout.co.in/delhi-restaurants/welcome-back")
page

In [89]:
soup=BeautifulSoup(page.content,"html.parser")

In [90]:
restname=soup.find_all("a",class_="restnt-name ellipsis")
cuis=soup.find_all("span",class_="double-line-ellipsis")
loc=soup.find_all("div",class_="restnt-loc ellipsis")
rat=soup.find_all("div",class_="restnt-rating rating-4")
im=soup.find_all("img",class_="no-img")

In [91]:
rtname=[]
cu=[]
lc=[]
rt=[]
mg=[]
for i in restname:
    rtname.append(i.text)
for i in cuis:
    cu.append(i.text)
for i in loc:
    lc.append(i.text)
for i in rat:
    rt.append(i.text)
for i in im:
    mg.append(i['data-src'])

In [92]:
dine={"Restaurant":rtname[:10],"Cuisine":cu[:10],"Location":lc[:10],"Ratings":rt[:10],"Image_URL":mg[:10]}

In [93]:
dine1=pd.DataFrame(dine)
dine1

,Restaurant,Cuisine,Location,Ratings,Image_URL
0,Tamasha,"₹ 1,800 for 2 (approx) | Continental, Finger F...","Connaught Place, Central Delhi",4.2,https://im1.dineout.co.in/images/uploads/resta...
1,Local,"₹ 2,000 for 2 (approx) | North Indian, Italian...","Scindia House,Connaught Place, Central Delhi",4,https://im1.dineout.co.in/images/uploads/resta...
2,The G.T. ROAD,"₹ 1,400 for 2 (approx) | North Indian","M-Block,Connaught Place, Central Delhi",4.3,https://im1.dineout.co.in/images/uploads/resta...
3,Unplugged Courtyard,"₹ 2,600 for 2 (approx) | North Indian, Italian...","Connaught Place, Central Delhi",4,https://im1.dineout.co.in/images/uploads/resta...
4,Ministry Of Beer,"₹ 2,800 for 2 (approx) | Italian, Chinese, Nor...","M-Block,Connaught Place, Central Delhi",4,https://im1.dineout.co.in/images/uploads/resta...
5,Out Of The Box Courtyard,"₹ 2,000 for 2 (approx) | North Indian, Orienta...","Connaught Place, Central Delhi",4.1,https://im1.dineout.co.in/images/uploads/resta...
6,The Junkyard Cafe,"₹ 1,800 for 2 (approx) | Mediterranean, North ...","Connaught Place, Central Delhi",4.1,https://im1.dineout.co.in/images/uploads/resta...
7,Connaught Clubhouse Microbrewery,"₹ 2,000 for 2 (approx) | North Indian, Italian...","Connaught Place, Central Delhi",4.2,https://im1.dineout.co.in/images/uploads/resta...
8,Chili's American Grill and Bar,"₹ 2,000 for 2 (approx) | Mexican, American, Te...","M-Block,Connaught Place, Central Delhi",4.3,https://im1.dineout.co.in/images/uploads/resta...
9,High 5 - Everyday Wholesale Bar,"₹ 1,700 for 2 (approx) | North Indian, Contine...","Connaught Place, Central Delhi",3.8,https://im1.dineout.co.in/images/uploads/resta...

**Q10) Write a python program to scrape first 10 product details which include product name , price , Image URL from
https://www.bewakoof.com/women-tshirts?ga_q=tshirts.**

In [94]:
page=requests.get("https://www.bewakoof.com/women-tshirts?ga_q=tshirts")
page

In [95]:
soup=BeautifulSoup(page.content,"html.parser")

In [96]:
product=soup.find_all("div",class_="productCardDetail")
price=soup.find_all("div",class_="loyaltyPriceBox")
image=soup.find_all("img",class_="productImgTag")

In [100]:
pdi=[]
pr=[]
im=[]
for i in product:
    pdi.append(i.text.split("₹")[0])
for i in price:
    pr.append(i.text.split("For")[0])
for i in image:
    im.append(i["src"])

In [102]:
pro={"ProductName":pdi[:10],"Price":pr[:10],"ImageUrl":im[:10]}

In [103]:
dr=pd.DataFrame(pro)

In [104]:
dr

,ProductName,Price,ImageUrl
0,Minimal Believe Boyfriend T-Shirt,₹229,https://images.bewakoof.com/t320/minimal-belie...
1,Minimal Believe Half Sleeve T-Shirt,₹279,https://images.bewakoof.com/t320/minimal-belie...
2,Bunny Rabbit Pocket Printed Half Sleeve T-Shirt,₹179,https://images.bewakoof.com/t320/bunny-rabbit-...
3,Cuteness Superpower Half Sleeve T-Shirt,₹279,https://images.bewakoof.com/t320/cuteness-supe...
4,Stay Classy Minnie Half Sleeve Printed T-shirt...,₹279,https://images.bewakoof.com/t320/stay-classy-m...
5,Goofy Mickey Pocket Half Sleeve Printed T-Shirt,₹229,https://images.bewakoof.com/t320/goofy-mickey-...
6,Friends logo (FRL) Printed Half Sleeve T-shirt,₹179,https://images.bewakoof.com/t320/friends-logo-...
7,Climbing pocket panda Printed Red T-shirt,₹179,https://images.bewakoof.com/t320/climbing-pock...
8,I'm Amazing Half Sleeve T-Shirt (TJL),₹229,https://images.bewakoof.com/t320/i-m-amazing-t...
9,Bonjour Paris Half Sleeve Printed Pink T-Shirt,₹179,https://images.bewakoof.com/t320/bonjour-paris...